module.exports = {
  printWidth: 100, // يحدد الحد الأقصى لعرض السطر. إذا تجاوز الكود هذا الحد، يتم تنسيقه تلقائيًا ليكون على عدة أسطر.
  singleQuote: true, // يفرض استخدام علامات التنصيص المفردة (') بدلاً من المزدوجة (").
  trailingComma: "all", // يضيف فاصلة زائدة في نهاية القوائم والكائنات المتعددة الأسطر، مما يسهل إضافة أسطر جديدة.
  overrides: [ // إعدادات خاصة لملفات محددة.
    {
      files: [
        "docs/**/*.md", // يطبق هذه الإعدادات على جميع ملفات Markdown في مجلد docs وأي مجلد فرعي.
        "docs/src/pages/**/*.{js,tsx}", // يطبق هذه الإعدادات على جميع ملفات JavaScript وTypeScript (React) في المسار المحدد.
        "docs/data/**/*.{js,tsx}", // يطبق هذه الإعدادات على ملفات JS وTSX في مجلد docs/data.
      ],
      options: {
        printWidth: 85, // يحدد عرض السطر الأقصى لهذه الملفات ليكون 85 حرفًا.
      },
    },
    {
      files: ["docs/pages/blog/**/*.md"], // إعداد خاص بملفات Markdown داخل مجلد blog ضمن docs/pages.
      options: {
        printWidth: 82, // يحدد عرض السطر الأقصى لهذه الملفات ليكون 82 حرفًا.
      },
    },
  ],
};
