//!Z
// يتكامل مع CssBaseline الذي يستدعي echart() لتطبيق التنسيقات على الرسوم البيانية في الواجهة.
// هذه الإعدادات تجعل مكونات الرسوم البيانية تحتل 100% من المساحة المتاحة، مما يوفر عرضًا متكاملًا للرسوم داخل التطبيقات.
// الفائدة: يسمح هذا التخصيص بضبط أبعاد الرسوم البيانية وتحديد نمط العرض المبدئي، ويمنع الزوائد من الظهور خارج الحدود.
// تهيئة إعدادات echart لمكتبة ECharts لتخصيص الرسوم البيانية

const echart = () => ({
  '.echarts-for-react': {
    overflow: 'hidden', // إخفاء الزوائد عن الحدود

    '&:not(&.echart-map)': {
      '> div': {
        // أول عنصر داخلي سيكون بطول 100% دائمًا
        '&:first-of-type': {
          height: '100% !important',
        },
      },
    },
  },
});

export default echart;
